Repository: ajayoneness/alburaq-new
Catalog: locale/*/LC_MESSAGES/django.po
Languages: ar

source: Registration successful! Welcome to AL BURAQ GROUP.
ar: تم التسجيل بنجاح! مرحباً بك في مجموعة البراق.

source: Welcome back!
ar: مرحباً بعودتك!

source: You have been logged out.
ar: تم تسجيل خروجك.

source: Profile updated successfully!
ar: تم تحديث الملف الشخصي بنجاح!

source: Product added to cart
ar: تمت إضافة المنتج إلى السلة

source: Item removed from cart
ar: تمت إزالة المنتج من السلة

source: Your cart is empty
ar: سلة التسوق فارغة

source: Specialized in international trade, sourcing, and logistics from China to the world. Quality products, reliable shipping, exceptional service.
ar: متخصصون في التجارة الدولية والتوريد والخدمات اللوجستية من الصين إلى العالم. منتجات عالية الجودة، شحن موثوق، وخدمة استثنائية.

source: Fast and reliable air freight services for time-sensitive shipments worldwide.
ar: خدمات شحن جوي سريعة وموثوقة للشحنات الحساسة للوقت في جميع أنحاء العالم.

source: Efficient rail and road transport connecting China to Central Asia and Europe.
ar: نقل فعال بالسكك الحديدية والطرق يربط الصين بآسيا الوسطى وأوروبا.

source: Expert product sourcing from verified Chinese manufacturers and suppliers.
ar: توريد منتجات خبير من مصنعين وموردين صينيين تم التحقق منهم.

source: Categories
ar: المنتجات

source: With over 10 years of experience in international trade, we have built a reputation for reliability, quality, and exceptional customer service.
ar: مع أكثر من 10 سنوات من الخبرة في التجارة الدولية، بنينا سمعة طيبة من حيث الموثوقية والجودة وخدمة العملاء الاستثنائية.

source: Rigorous quality control on all products
ar: مراقبة جودة صارمة على جميع المنتجات

source: Direct factory prices without middlemen
ar: أسعار المصنع مباشرة بدون وسطاء

source: Delivery to 50+ countries worldwide
ar: التسليم لأكثر من 50 دولة حول العالم

source: Multilingual team available 24/7
ar: فريق متعدد اللغات متاح 24/7

source: Ready to Start Your Import Business?
ar: هل أنت مستعد لبدء أعمال الاستيراد الخاصة بك؟

source: Join thousands of satisfied clients who trust AL BURAQ GROUP for their sourcing and logistics needs.
ar: انضم إلى آلاف العملاء الراضين الذين يثقون في مجموعة البراق لاحتياجاتهم من التوريد والخدمات اللوجستية.

source: Dashboard
ar: لوحة التحكم

source: Welcome,
ar: مرحباً،

source: Manage your account and orders
ar: إدارة حسابك وطلباتك

source: Logout
ar: تسجيل الخروج

source: Total Orders
ar: إجمالي الطلبات

source: Active Shipments
ar: الشحنات النشطة

source: Completed
ar: مكتملة

source: Cart Items
ar: عناصر السلة

source: Recent Orders
ar: الطلبات الأخيرة

source: View All
ar: عرض الكل

source: Order
ar: الطلب

source: Date
ar: التاريخ

source: Status
ar: الحالة

source: Total
ar: المجموع

source: No orders yet
ar: لا توجد طلبات بعد

source: Start Shopping
ar: ابدأ التسوق

source: Edit Profile
ar: تعديل الملف الشخصي

source: Change Password
ar: تغيير كلمة المرور

source: Quick Actions
ar: إجراءات سريعة

source: Browse Products
ar: تصفح المنتجات

source: View Cart
ar: عرض السلة

source: Track Shipment
ar: تتبع الشحنة

source: Contact Support
ar: التواصل مع الدعم

source: Login
ar: تسجيل الدخول

source: Welcome Back
ar: مرحباً بعودتك

source: Sign in to your account
ar: سجل الدخول إلى حسابك

source: Invalid username or password.
ar: اسم المستخدم أو كلمة المرور غير صحيحة.

source: Username or Email
ar: اسم المستخدم أو البريد الإلكتروني

source: Password
ar: كلمة المرور

source: Remember me
ar: تذكرني

source: Forgot password?
ar: نسيت كلمة المرور؟

source: Sign In
ar: تسجيل الدخول

source: Don't have an account?
ar: ليس لديك حساب؟

source: Sign Up
ar: إنشاء حساب

source: First Name
ar: الاسم الأول

source: Last Name
ar: اسم العائلة

source: Email
ar: البريد الإلكتروني

source: Phone
ar: الهاتف

source: Company
ar: الشركة

source: Country
ar: الدولة

source: Address
ar: العنوان

source: Save Changes
ar: حفظ التغييرات

source: Cancel
ar: إلغاء

source: Register
ar: التسجيل

source: Create Account
ar: إنشاء حساب

source: Join us and start trading
ar: انضم إلينا وابدأ التداول

source: Username
ar: اسم المستخدم

source: Phone (with country code)
ar: الهاتف (مع رمز الدولة)

source: Select your country
ar: اختر دولتك

source: Confirm Password
ar: تأكيد كلمة المرور

source: I agree to the
ar: أوافق على

source: Terms of Service
ar: شروط الخدمة

source: Already have an account?
ar: لديك حساب بالفعل؟

source: Home
ar: الرئيسية

source: About Us
ar: من نحن

source: Services
ar: خدماتنا

source: Store
ar: المتجر

source: Tracking
ar: تتبع الشحنات

source: FAQ
ar: الأسئلة الشائعة

source: Contact
ar: اتصل بنا

source: Your trusted partner for international trade, sourcing, and logistics from China to the world.
ar: شريكك الموثوق للتجارة الدولية والخدمات اللوجستية من الصين إلى العالم.

source: Quick Links
ar: روابط سريعة

source: Air Shipping
ar: الشحن الجوي

source: Sea Shipping
ar: الشحن البحري

source: Land Shipping
ar: الشحن البري

source: Sourcing
ar: المصادر والتوريد

source: Contact Us
ar: تواصل معنا

source: WhatsApp
ar: واتساب

source: All rights reserved.
ar: جميع الحقوق محفوظة.

source: Made with
ar: صنع بـ

source: in China
ar: في الصين

source: Chat on WhatsApp
ar: دردشة عبر واتساب

source: AL BURAQ GROUP - International Trade & Logistics
ar: مجموعة البراق - التجارة الدولية والخدمات اللوجستية

source: Your Gateway to
ar: بوابتك إلى

source: Global Trade
ar: التجارة العالمية

source: Browse Store
ar: تصفح المتجر

source: Years Experience
ar: سنوات من الخبرة

source: Products
ar: منتجاتنا

source: Happy Clients
ar: عملاء سعداء

source: Countries Served
ar: الدول المخدومة

source: Our
ar: خدماتنا

source: Comprehensive trade and logistics solutions tailored to your needs
ar: حلول تجارية ولوجستية شاملة مصممة خصيصاً لاحتياجاتك

source: Cost-effective sea freight solutions for bulk and large shipments.
ar: حلول شحن بحري فعالة من حيث التكلفة للشحنات الضخمة والكبيرة.

source: Quality Control
ar: مراقبة الجودة

source: Rigorous quality inspection to ensure products meet your standards.
ar: فحص صارم للجودة لضمان تلبية المنتجات لمعاييرك.

source: Packing & Assembly
ar: التغليف والتجميع

source: Professional packaging and assembly services for your products.
ar: خدمات تغليف وتجميع احترافية لمنتجاتك.

source: Documentation
ar: التوثيق

source: Complete customs clearance and documentation handling.
ar: تخليص جمركي كامل ومعالجة الوثائق.

source: 24/7 Support
ar: دعم على مدار الساعة

source: Dedicated support team available round the clock for assistance.
ar: فريق دعم مخصص متاح على مدار الساعة للمساعدة.

source: View All Services
ar: عرض جميع الخدمات

source: Product
ar: تصنيفات

source: Explore our wide range of wholesale products from China
ar: استكشف مجموعتنا الواسعة من المنتجات بالجملة من الصين

source: products
ar: منتجات

source: Categories coming soon...
ar: التصنيفات قريباً...

source: Browse All Products
ar: تصفح جميع المنتجات

source: Why Choose
ar: لماذا تختار

source: Quality Guaranteed
ar: جودة مضمونة

source: Competitive Prices
ar: أسعار تنافسية

source: Global Shipping
ar: شحن عالمي

source: Dedicated Support
ar: دعم مخصص

source: Track Your Shipment
ar: تتبع شحنتك

source: Enter tracking number...
ar: أدخل رقم التتبع...

source: Track Now
ar: تتبع الآن

source: Need help? Contact us directly:
ar: تحتاج مساعدة؟ اتصل بنا مباشرة:

source: Offices
ar: مكاتبنا

source: Visit our offices in China for personalized service
ar: تفضل بزيارة مكاتبنا في الصين للحصول على خدمة مخصصة

source: Frequently Asked Questions
ar: الأسئلة الشائعة

source: Frequently Asked
ar: الأسئلة

source: Questions
ar: الشائعة

source: Find answers to common questions about our services, shipping, and costs
ar: اعثر على إجابات للأسئلة الشائعة حول خدماتنا والشحن والتكاليف

source: General Questions
ar: أسئلة عامة

source: Shipping
ar: الشحن

source: Payment
ar: الدفع

source: Customs Clearance
ar: التخليص الجمركي

source: No FAQs available yet.
ar: لا توجد أسئلة شائعة متاحة حالياً

source: Still have questions?
ar: لا تزال لديك أسئلة؟

source: Can't find the answer you're looking for? Our team is here to help.
ar: لم تجد الإجابة التي تبحث عنها؟ فريقنا هنا للمساعدة.

source: Email Us
ar: راسلنا عبر البريد

source: Shopping Cart
ar: سلة التسوق

source: Continue Shopping
ar: متابعة التسوق

source: Order Summary
ar: ملخص الطلب

source: Items
ar: العناصر

source: Subtotal
ar: المجموع الفرعي

source: Shipping costs will be calculated after checkout.
ar: سيتم حساب تكاليف الشحن بعد إتمام الطلب.

source: Proceed to Checkout
ar: المتابعة إلى الدفع

source: Or inquire directly:
ar: أو استفسر مباشرة:

source: I would like to place an order
ar: أود تقديم طلب

source: Order via WhatsApp
ar: اطلب عبر واتساب

source: Browse our products and add items to your cart.
ar: تصفح منتجاتنا وأضف العناصر إلى سلتك.

source: Remove this item from cart?
ar: إزالة هذا المنتج من السلة؟

source: Checkout
ar: إتمام الطلب

source: Contact Information
ar: معلومات الاتصال

source: Full Name
ar: الاسم الكامل

source: Shipping Address
ar: عنوان الشحن

source: City
ar: المدينة

source: Postal Code
ar: الرمز البريدي

source: Full Address
ar: العنوان الكامل

source: Street address, building, floor, etc.
ar: عنوان الشارع، المبنى، الطابق، إلخ.

source: Additional Notes
ar: ملاحظات إضافية

source: Order Notes
ar: ملاحظات الطلب

source: Any special instructions for your order...
ar: أي تعليمات خاصة لطلبك...

source: Place Order
ar: تأكيد الطلب

source: After placing your order, you'll receive an Excel order sheet and can complete payment via WhatsApp.
ar: بعد تقديم طلبك، ستتلقى ورقة طلب إكسل ويمكنك إتمام الدفع عبر واتساب.

source: Back to Cart
ar: العودة إلى السلة

source: Order Complete
ar: اكتمل الطلب

source: Order Placed Successfully!
ar: تم تقديم الطلب بنجاح!

source: Thank you for your order. Your order number is:
ar: شكراً لطلبك. رقم طلبك هو:

source: Next Steps:
ar: الخطوات التالية:

source: Download your order details (Excel)
ar: تحميل تفاصيل طلبك (إكسل)

source: Contact us via WhatsApp to confirm your order
ar: تواصل معنا عبر واتساب لتأكيد طلبك

source: We'll provide shipping quote and payment details
ar: سنوفر لك عرض سعر الشحن وتفاصيل الدفع

source: Download Order Excel
ar: تحميل إكسل الطلب

source: Confirm via WhatsApp
ar: تأكيد عبر واتساب

source: Order Details
ar: تفاصيل الطلب

source: Back to Home
ar: العودة إلى الصفحة الرئيسية

source: About
ar: عن

source: Your trusted partner for international trade and logistics from China
ar: شريكك الموثوق للتجارة الدولية والخدمات اللوجستية من الصين إلى العالم

source: Established in China
ar: تأسست في الصين

source: Over 10 Years of Excellence
ar: أكثر من 10 سنوات من التميز

source: Our Story
ar: قصتنا

source: AL BURAQ GROUP was founded with a vision to bridge the gap between Chinese manufacturers and international buyers. Named after the legendary creature known for its speed and reliability, we embody these qualities in every aspect of our service.
ar: تأسست مجموعة البراق برؤية واضحة تهدف إلى سد الفجوة بين المصنعين الصينيين والمشترين الدوليين. سُميت تيمناً بالمخلوق الأسطوري المعروف بسرعته وموثوقيته، ونحن نجسد هذه الصفات في كل جانب من جوانب خدماتنا.

source: With offices strategically located in Yiwu and Guangzhou - two of China's largest trading hubs - we provide our clients with direct access to thousands of factories and suppliers.
ar: مع مكاتب تقع استراتيجياً في ييوو وقوانغتشو - وهما من أكبر المراكز التجارية في الصين - نوفر لعملائنا وصولاً مباشراً إلى آلاف المصانع والموردين.

source: Our multilingual team speaks Arabic, English, Chinese, French, Turkish, Spanish, Italian, and Russian, ensuring smooth communication with clients from all over the world.
ar: فريقنا متعدد اللغات يتحدث العربية، الإنجليزية، الصينية، الفرنسية، التركية، الإسبانية، الإيطالية، والروسية، مما يضمن تواصلاً سلساً مع العملاء من جميع أنحاء العالم.

source: Our Vision
ar: رؤيتنا

source: To be the world's most trusted bridge between Chinese manufacturers and global businesses, setting the standard for quality, reliability, and customer service in international trade.
ar: أن نكون الجسر الأكثر موثوقية في العالم بين المصنعين الصينيين والشركات العالمية، واضعين معايير جديدة للجودة والموثوقية وخدمة العملاء في التجارة الدولية.

source: Our Mission
ar: مهمتنا

source: To provide comprehensive trade solutions that empower businesses worldwide to source quality products from China with confidence, efficiency, and complete peace of mind.
ar: تقديم حلول تجارية شاملة تمكن الشركات في جميع أنحاء العالم من استيراد منتجات عالية الجودة من الصين بثقة وكفاءة وراحة بال تامة.

source: Our Core Values
ar: قيمنا الجوهرية

source: Trust
ar: الثقة

source: Building lasting relationships through honesty and integrity
ar: بناء علاقات دائمة من خلال الصدق والنزاهة

source: Quality
ar: الجودة

source: Uncompromising standards in every product we handle
ar: معايير صارمة في كل منتج نتعامل معه

source: Innovation
ar: الابتكار

source: Continuously improving our processes and services
ar: تحسين مستمر لعملياتنا وخدماتنا

source: Global Reach
ar: الانتشار العالمي

source: Serving clients in over 50 countries worldwide
ar: نخدم عملاء في أكثر من 50 دولة حول العالم

source: CEO & Founder
ar: المدير التنفيذي والمؤسس

source: Chief Executive Officer
ar: الرئيس التنفيذي

source: Leading AL BURAQ GROUP with vision and dedication to excellence in international trade.
ar: قيادة مجموعة البراق برؤية وتفانٍ في التميز في التجارة الدولية.

source: Operations Manager
ar: مدير العمليات

source: Head of Operations
ar: رئيس العمليات

source: Ensuring smooth logistics and delivery for all our clients worldwide.
ar: ضمان سلاسة الخدمات اللوجستية والتسليم لجميع عملائنا حول العالم.

source: Sales Director
ar: مدير المبيعات

source: Head of Sales
ar: رئيس قسم المبيعات

source: Building relationships and connecting clients with the best suppliers in China.
ar: بناء العلاقات وربط العملاء بأفضل الموردين في الصين.

source: Ready to Work With Us?
ar: هل أنت مستعد للعمل معنا؟

source: Contact our team today and let's discuss your sourcing needs.
ar: تواصل مع فريقنا اليوم ودعنا نناقش احتياجاتك من التوريد.

source: Get in
ar: تواصل

source: Touch
ar: معنا

source: We'd love to hear from you. Reach out to us through any of the channels below.
ar: يسعدنا سماع رأيك. تواصل معنا عبر أي من القنوات أدناه.

source: Chat with us instantly
ar: تحدث معنا فوراً

source: Send us an email
ar: أرسل لنا بريداً إلكترونياً

source: Call us directly
ar: اتصل بنا مباشرة

source: Send Us a Message
ar: أرسل لنا رسالة

source: Your Name
ar: اسمك

source: Subject
ar: الموضوع

source: Select a subject
ar: اختر موضوعاً

source: General Inquiry
ar: استفسار عام

source: Product Sourcing
ar: توريد المنتجات

source: Shipping Quote
ar: عرض سعر الشحن

source: Order Status
ar: حالة الطلب

source: Partnership
ar: شراكة

source: Other
ar: أخرى

source: Your Message
ar: رسالتك

source: Tell us about your requirements...
ar: أخبرنا عن متطلباتك...

source: Send Message
ar: إرسال الرسالة

source: Our Offices
ar: مكاتبنا

source: Follow Us
ar: تابعنا

source: Comprehensive trade and logistics solutions for your business
ar: حلول تجارية ولوجستية شاملة لأعمالك

source: Fast and reliable air freight services for time-sensitive shipments. Ideal for urgent orders and high-value goods that need quick delivery worldwide.
ar: خدمات الشحن الجوي السريعة والموثوقة للشحنات الحساسة للوقت. مثالية للطلبات العاجلة والبضائع ذات القيمة العالية التي تحتاج إلى تسليم سريع في جميع أنحاء العالم.

source: Delivery in 3-7 days
ar: التسليم في 3-7 أيام

source: Door-to-door service
ar: خدمة من الباب إلى الباب

source: Real-time tracking
ar: تتبع في الوقت الحقيقي

source: Cost-effective ocean freight for bulk shipments. Perfect for large orders where time is flexible but cost efficiency is paramount.
ar: شحن بحري فعال من حيث التكلفة للشحنات الضخمة. مثالي للطلبات الكبيرة حيث يكون الوقت مرنًا ولكن الكفاءة من حيث التكلفة هي الأهم.

source: FCL & LCL options
ar: خيارات FCL و LCL

source: Major ports worldwide
ar: الموانئ الرئيسية في جميع أنحاء العالم

source: Competitive rates
ar: أسعار تنافسية

source: Rail and road freight connecting China to Central Asia, Middle East, and Europe via the Belt and Road routes.
ar: الشحن عبر السكك الحديدية والطرق البرية الذي يربط الصين بآسيا الوسطى والشرق الأوسط وأوروبا عبر طرق الحزام والطريق.

source: China-Europe Express
ar: قطار الصين-أوروبا السريع

source: Faster than sea freight
ar: أسرع من الشحن البحري

source: Regular departures
ar: رحلات منتظمة

source: Sourcing & Purchasing
ar: التوريد والشراء

source: Expert product sourcing from verified Chinese manufacturers. We find the best suppliers and negotiate the best prices for you.
ar: توريد منتجات خبير من مصنعين صينيين تم التحقق منهم. نجد أفضل الموردين ونتفاوض على أفضل الأسعار لك.

source: Factory verification
ar: التحقق من المصنع

source: Price negotiation
ar: التفاوض على السعر

source: Sample management
ar: إدارة العينات

source: Rigorous quality inspection at every stage. Our QC team ensures products meet your specifications before shipping.
ar: فحص دقيق للجودة في كل مرحلة. يضمن فريق مراقبة الجودة لدينا أن المنتجات تلبي مواصفاتك قبل الشحن.

source: Pre-shipment inspection
ar: فحص ما قبل الشحن

source: Detailed reports
ar: تقارير مفصلة

source: Photo documentation
ar: توثيق بالصور

source: Assembly & Packing
ar: التجميع والتغليف

source: Professional packaging and assembly services. We consolidate products from multiple suppliers and pack according to your requirements.
ar: خدمات تغليف وتجميع احترافية. نقوم بدمج المنتجات من موردين متعددين وتغليفها وفقًا لمتطلباتك.

source: Custom packaging
ar: تغليف مخصص

source: Labeling & branding
ar: وضع العلامات والعلامات التجارية

source: Consolidation
ar: تجميع الشحنات

source: Documentation & Customs
ar: التوثيق والجمارك

source: Complete customs clearance and documentation handling. We navigate complex regulations so you don't have to.
ar: تخليص جمركي كامل ومعالجة الوثائق. نتنقل عبر اللوائح المعقدة حتى لا تضطر لذلك.

source: Export documentation
ar: وثائق التصدير

source: Customs clearance
ar: التخليص الجمركي

source: Compliance consulting
ar: استشارات الامتثال

source: Mechanism of Action
ar: آلية العمل

source: A streamlined process from order to delivery. We handle every step of your import journey with precision and care.
ar: عملية مبسطة من الطلب إلى التسليم. نتعامل مع كل خطوة في رحلة الاستيراد الخاصة بك بدقة وعناية.

source: End-to-end management
ar: إدارة شاملة

source: Regular updates
ar: تحديثات منتظمة

source: Dedicated support
ar: دعم مخصص

source: Success Stories
ar: قصص النجاح

source: Join hundreds of satisfied clients who have grown their businesses with AL BURAQ GROUP. Our track record speaks for itself.
ar: انضم إلى مئات العملاء الراضين الذين نموا أعمالهم مع مجموعة البراق. سجلنا يتحدث عن نفسه.

source: View Case Studies
ar: عرض دراسات الحالة

source: Need a Custom Solution?
ar: هل تحتاج إلى حل مخصص؟

source: Contact us to discuss your specific requirements and get a tailored quote.
ar: اتصل بنا لمناقشة متطلباتك الخاصة والحصول على عرض أسعار مخصص.

source: Get a Quote
ar: احصل على عرض أسعار

source: Success
ar: قصص

source: Stories
ar: النجاح

source: See how we've helped businesses grow with our sourcing and logistics services
ar: شاهد كيف ساعدنا الشركات على النمو من خلال خدمات التوريد واللوجستيات

source: Results
ar: النتائج

source: Success stories coming soon
ar: قصص النجاح قريباً

source: Ready to Be Our Next Success Story?
ar: هل أنت مستعد لتكون قصة نجاحنا القادمة؟

source: Start your journey with AL BURAQ GROUP today.
ar: ابدأ رحلتك مع مجموعة البراق اليوم.

source: Get Started
ar: ابدأ الآن

source: Subcategories
ar: التصنيفات الفرعية

source: Min
ar: الحد الأدنى

source: No products in this category yet
ar: لا توجد منتجات في هذا التصنيف بعد

source: Browse Our
ar: تصفح

source: Explore our wide range of quality products
ar: استكشف مجموعتنا الواسعة من المنتجات عالية الجودة

source: Search products...
ar: بحث عن المنتجات...

source: No categories available yet.
ar: لا توجد فئات متاحة حالياً

source: Can't find what you're looking for?
ar: لم تجد ما تبحث عنه؟

source: Let us help you source the exact product you need directly from manufacturers.
ar: دعنا نساعدك في العثور على المنتج المحدد الذي تحتاجه مباشرة من المصنعين.

source: WhatsApp Us
ar: تواصل معنا عبر واتساب

source: Send Inquiry
ar: إرسال استفسار

source: Minimum Order
ar: الحد الأدنى للطلب

source: Availability
ar: التوفر

source: In Stock
ar: متوفر

source: Add to Cart
ar: أضف إلى السلة

source: I am interested in:
ar: أنا مهتم بـ:

source: Inquire on WhatsApp
ar: استفسر عبر واتساب

source: Description
ar: الوصف

source: Specifications
ar: المواصفات

source: Related Products
ar: منتجات ذات صلة

source: View
ar: عرض

source: Track Your
ar: تتبع

source: Shipment
ar: شحنتك

source: Our Agents
ar: وكلاؤنا

source: Agents
ar: حول العالم

source: We are proud at Al Buraq Group to have a network of agents and partners in several countries around the world, working with us to provide the best sourcing, shipping, and industrial equipment solutions. We continue to expand our agent network to ensure closer and faster service to our clients and partners in various markets.
ar: نفخر في مجموعة البراق بشبكة وكلاء وشركاء في عدة دول حول العالم، يعملون معنا لتوفير أفضل حلول التوريد والشحن والمعدات الصناعية. نواصل توسيع شبكة وكلائنا لضمان خدمة أقرب وأسرع لعملائنا وشركائنا في مختلف الأسواق.

source: Team Members:
ar: فريق العمل:

source: More agents coming soon...
ar: قريباً سنضيف المزيد من الوكلاء...

source: Join Al Buraq Agents
ar: انضم لوكلاء البراق
